Reports/ОтчётПоВесуПоставокПоРейсам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчётПоВесуПоставокПоРейсам</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТарифыНаДоставкуПоМаршруту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТарифыНаДоставкуПоМаршруту</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаКг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВесОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиныйТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/МаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>МаршрутныйЛист</Name>
			<BasedOn>
				<xr:Item>Document.АК_ЗаявкаНаПеревозку</xr:Item>
				<xr:Item>Document.ЗаявкаНаУслугиМатериалы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АвансыПоАкцептантам</xr:Item>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНаДоставкуПоПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АК_ВидыПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутТранспортныхКомпаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставкиПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставкиФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаНачата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУслугиМатериалы</v8:Type>
						<v8:Type>cfg:DocumentRef.АК_ЗаявкаНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыПолучены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПолученныхДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПолученныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УПД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодачиМашины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУслугиМатериалы</v8:Type>
						<v8:Type>cfg:DocumentRef.АК_ЗаявкаНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КладовщикНаДебаркадере</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанСМаршрутнымЛистом</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТТН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаДоставкиНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГруппыДоставкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаРазгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияРазгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолвоСетокВПоставке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходныеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйОрдерСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПриходныеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчётПоВесуПоставокПоРейсам/Ext/ObjectModule.bsl
Перем тзСоответствиеРольПеревозчик;

// Для корректного функционирования отчёта все роли для которых доступен данный отчёт
// должны иметь полный доступ к константе "ХранилищеОтчётПоВесуПоставокПоРейсам"!

//+++АК sole 2018.06.06 ИП-00018920
Процедура Конструктор()
	
	Хранилище = Константы.ХранилищеОтчётПоВесуПоставокПоРейсам.Получить();
	
	тзСоответствиеРольПеревозчик = Хранилище.Получить();	
	
	Если тзСоответствиеРольПеревозчик  = Неопределено Тогда
		ЗаполнитьХранилищеОтчётПоВесуПоставокПоРейсам();
	КонецЕсли;
	
КонецПроцедуры


//+++АК sole 2018.06.07 ИП-00018920
Функция ПолучитьТекстЗапросаДляФормированияОтчёта()
	
	Перем ТекстЗапроса;
	
	ТекстЗапроса =
"ВЫБРАТЬ
|	МаршрутныйЛистПриходныеОрдера.Ссылка КАК МаршрутныйЛист,
|	СУММА(ЕСТЬNULL(ПриходныйОрдерСкладТовары.ЕдиницаИзмерения.Вес, 0) * ЕСТЬNULL(ПриходныйОрдерСкладТовары.Количество, 0)) КАК Вес,
|	МаршрутныйЛистПриходныеОрдера.Ссылка.СвязанСМаршрутнымЛистом КАК СвязанСМаршрутнымЛистом
|		
|		ПОМЕСТИТЬ втСписокРейсовСВесами
|
|ИЗ Документ.МаршрутныйЛист.ПриходныеОрдера КАК МаршрутныйЛистПриходныеОрдера
|
|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерСклад.Товары КАК ПриходныйОрдерСкладТовары ПО
|		ПриходныйОрдерСкладТовары.Ссылка = МаршрутныйЛистПриходныеОрдера.ПриходныйОрдер
|
|ГДЕ
|		МаршрутныйЛистПриходныеОрдера.Ссылка.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.АК_ВидыПеревозки.ДоставкаНаСклад)
|	И	МаршрутныйЛистПриходныеОрдера.Ссылка.Дата >= &ДатаНачала  
|	И	МаршрутныйЛистПриходныеОрдера.Ссылка.Дата < &ДатаОкончания
|	И	
|		(
|				МаршрутныйЛистПриходныеОрдера.Ссылка.Перевозчик = &Перевозчик
|			ИЛИ	ЕСТЬNULL(&Перевозчик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
|		)
|	И	НЕ МаршрутныйЛистПриходныеОрдера.Ссылка.ПометкаУдаления
|
|СГРУППИРОВАТЬ ПО 
|	МаршрутныйЛистПриходныеОрдера.Ссылка
|	
|ИНДЕКСИРОВАТЬ ПО МаршрутныйЛистПриходныеОрдера.Ссылка
|;
|///////////////////////////////////////////////////////////
|ВЫБРАТЬ	
|	втСписокРейсовСВесами.МаршрутныйЛист,
|	втСписокРейсовСВесами.Вес,
|	втСписокРейсовСВесами.Вес + ЕСТЬNULL(СвязанныеРейсы1.Вес, 0) + ЕСТЬNULL(СвязанныеРейсы2.Вес, 0) КАК ОбщийВесРейса
|
|		ПОМЕСТИТЬ втСписокРейсовСОбщимиВесами
|
|ИЗ втСписокРейсовСВесами
|	ЛЕВОЕ СОЕДИНЕНИЕ втСписокРейсовСВесами КАК СвязанныеРейсы1 ПО
|			СвязанныеРейсы1.СвязанСМаршрутнымЛистом = втСписокРейсовСВесами.МаршрутныйЛист
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ втСписокРейсовСВесами КАК СвязанныеРейсы2 ПО
|			СвязанныеРейсы2.МаршрутныйЛист = втСписокРейсовСВесами.СвязанСМаршрутнымЛистом
|		И	СвязанныеРейсы1.СвязанСМаршрутнымЛистом ЕСТЬ NULL
|
|ГДЕ
|		втСписокРейсовСВесами.МаршрутныйЛист.Проведен
|	И	втСписокРейсовСВесами.Вес <> 0
|
|ИНДЕКСИРОВАТЬ ПО втСписокРейсовСВесами.МаршрутныйЛист
|;
|///////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.МаршрутТранспортныхКомпаний КАК Маршрут,
|	МАКСИМУМ(ТарифыНаДоставкуПоМаршрутуСрезПоследних.Период) КАК Период
|	
|		ПОМЕСТИТЬ втТарифыНаДоставкуПоМаршрутуСрезПоследних
|
|ИЗ втСписокРейсовСОбщимиВесами
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыНаДоставкуПоМаршруту.СрезПоследних(&ДатаОкончания) КАК ТарифыНаДоставкуПоМаршрутуСрезПоследних ПО
|			ТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут = втСписокРейсовСОбщимиВесами.МаршрутныйЛист.МаршрутТранспортныхКомпаний
|	
|СГРУППИРОВАТЬ ПО
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист
|		
|ИНДЕКСИРОВАТЬ ПО втСписокРейсовСОбщимиВесами.МаршрутныйЛист
|;
|///////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист,
|	втТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут,
|	втТарифыНаДоставкуПоМаршрутуСрезПоследних.Период,
|	МИНИМУМ(втСписокРейсовСОбщимиВесами.ОбщийВесРейса - ТарифыНаДоставкуПоМаршруту.ВесОт) КАК МинРазницаВеса
|
|		ПОМЕСТИТЬ втСписокРейсовДляПодбораТарифаПоВесу
|			
|ИЗ втТарифыНаДоставкуПоМаршрутуСрезПоследних
|
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСписокРейсовСОбщимиВесами ПО
|			втСписокРейсовСОбщимиВесами.МаршрутныйЛист = втТарифыНаДоставкуПоМаршрутуСрезПоследних.МаршрутныйЛист	
|
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту ПО
|			НЕ ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф
|		И	ТарифыНаДоставкуПоМаршруту.Маршрут = втТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут
|		И	ТарифыНаДоставкуПоМаршруту.Период = втТарифыНаДоставкуПоМаршрутуСрезПоследних.Период 
|		И	ТарифыНаДоставкуПоМаршруту.ВесОт <= втСписокРейсовСОбщимиВесами.ОбщийВесРейса
|
|СГРУППИРОВАТЬ ПО
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист,
|	втТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут,
|	втТарифыНаДоставкуПоМаршрутуСрезПоследних.Период
|	
|ИНДЕКСИРОВАТЬ ПО втСписокРейсовСОбщимиВесами.МаршрутныйЛист
|;
|///////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Дата КАК Дата,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Номер,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Организация КАК Организация,
|	втСписокРейсовДляПодбораТарифаПоВесу.Маршрут,
|	МаршрутыТранспортныхКомпанийПоставщики.Поставщик КАК Поставщик,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Перевозчик КАК Перевозчик,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист,
|	втСписокРейсовСОбщимиВесами.Вес,
|	ТарифыНаДоставкуПоМаршруту.ВесОт,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Сумма КАК Сумма,
|	ТарифыНаДоставкуПоМаршруту.ВариантРасчетаНДС,
|	ТарифыНаДоставкуПоМаршруту.СтавкаНДС,	
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.СуммаНДС КАК СуммаНДС,
|	ТарифыНаДоставкуПоМаршруту.Сумма КАК ЦенаЗаКг,
|	0 КАК ЕдиныйТариф,
|	ТарифыНаДоставкуПоМаршруту.ЦенаЗаКг КАК ТарификацияПоВесу,
|	втСписокРейсовСОбщимиВесами.ОбщийВесРейса
|	
|ИЗ втСписокРейсовДляПодбораТарифаПоВесу
|	
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСписокРейсовСОбщимиВесами ПО
|			втСписокРейсовСОбщимиВесами.МаршрутныйЛист = втСписокРейсовДляПодбораТарифаПоВесу.МаршрутныйЛист	
|	
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту ПО
|			НЕ ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф
|		И	ТарифыНаДоставкуПоМаршруту.Маршрут = втСписокРейсовДляПодбораТарифаПоВесу.Маршрут								
|		И	ТарифыНаДоставкуПоМаршруту.Период = втСписокРейсовДляПодбораТарифаПоВесу.Период 
|		И	ТарифыНаДоставкуПоМаршруту.ВесОт <= втСписокРейсовСОбщимиВесами.ОбщийВесРейса
|		И	втСписокРейсовДляПодбораТарифаПоВесу.МинРазницаВеса = (втСписокРейсовСОбщимиВесами.ОбщийВесРейса - ТарифыНаДоставкуПоМаршруту.ВесОт)
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаршрутыТранспортныхКомпаний.Поставщики КАК МаршрутыТранспортныхКомпанийПоставщики ПО
|			МаршрутыТранспортныхКомпанийПоставщики.Ссылка = втСписокРейсовДляПодбораТарифаПоВесу.Маршрут
|		И	МаршрутыТранспортныхКомпанийПоставщики.НомерСтроки = 1	
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Дата,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Номер,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Организация КАК Организация,
|	втТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут,
|	МаршрутыТранспортныхКомпанийПоставщики.Поставщик КАК Поставщик,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Перевозчик КАК Перевозчик,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист,
|	втСписокРейсовСОбщимиВесами.Вес,
|	ТарифыНаДоставкуПоМаршруту.ВесОт,
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.Сумма КАК Сумма,
|	ТарифыНаДоставкуПоМаршруту.ВариантРасчетаНДС,
|	ТарифыНаДоставкуПоМаршруту.СтавкаНДС,	
|	втСписокРейсовСОбщимиВесами.МаршрутныйЛист.СуммаНДС КАК СуммаНДС,
|	0 КАК ЦенаЗаКг,
|	ТарифыНаДоставкуПоМаршруту.Сумма КАК ЕдиныйТариф,
|	ТарифыНаДоставкуПоМаршруту.ЦенаЗаКг КАК ТарификацияПоВесу,
|	втСписокРейсовСОбщимиВесами.ОбщийВесРейса
|	
|
|ИЗ втТарифыНаДоставкуПоМаршрутуСрезПоследних
|
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСписокРейсовСОбщимиВесами ПО
|			втСписокРейсовСОбщимиВесами.МаршрутныйЛист = втТарифыНаДоставкуПоМаршрутуСрезПоследних.МаршрутныйЛист	
|	
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыНаДоставкуПоМаршруту КАК ТарифыНаДоставкуПоМаршруту ПО
|			ТарифыНаДоставкуПоМаршруту.ЕдиныйТариф
|		И	ТарифыНаДоставкуПоМаршруту.Маршрут = втТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут								
|		И	ТарифыНаДоставкуПоМаршруту.Период = втТарифыНаДоставкуПоМаршрутуСрезПоследних.Период
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаршрутыТранспортныхКомпаний.Поставщики КАК МаршрутыТранспортныхКомпанийПоставщики ПО
|			МаршрутыТранспортныхКомпанийПоставщики.Ссылка = втТарифыНаДоставкуПоМаршрутуСрезПоследних.Маршрут
|		И	МаршрутыТранспортныхКомпанийПоставщики.НомерСтроки = 1
|";
	
	Возврат	ТекстЗапроса;
	
КонецФункции 


//+++АК sole 2018.06.06 ИП-00018920
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Перем ВнешниеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	СкорректироватьПараметрПеревозчик();
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзРезультат = СформироватьТаблицуРезультата();	
	
	ВнешниеДанные = Новый Структура("тзРезультат", тзРезультат);
	
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
      
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеДанные, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//+++АК sole 2018.06.06 ИП-00018920
Процедура СкорректироватьПараметрПеревозчик()
	
	ПараметрПеревозчик = ПолучитьПараметрПользователя("Перевозчик");
	
	Если ПараметрПеревозчик.Использование = Ложь Тогда
		ПараметрПеревозчик.Значение = Справочники.Контрагенты.ПустаяСсылка();
		ПараметрПеревозчик.Использование = Истина;
	КонецЕсли;
	
	НетОграничений = ОпределитьНаличииеОграниченийДляПользователя();
	
	Если НетОграничений  Тогда
		Возврат;	
	КонецЕсли;

	Если ПараметрПеревозчик.Значение <> Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Перевозчик", ПараметрПеревозчик.Значение);
		мНайденныеСтроки = тзСоответствиеРольПеревозчик.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого Стр Из мНайденныеСтроки Цикл
			Если РольДоступна(Стр["НаименованиеРоли"]) Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Стр Из тзСоответствиеРольПеревозчик Цикл
		Если РольДоступна(Стр["НаименованиеРоли"]) Тогда
			ПараметрПеревозчик.Значение = Стр["Перевозчик"];
			Сообщить("В связи с действующими ограничениями текущего пользователя, значение параметра ""перевозчик"" изменено на """ + Стр["Перевозчик"] + """.");
			Прервать;	
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

//+++АК sole 2018.06.06 ИП-00018920
Функция ОпределитьНаличииеОграниченийДляПользователя()
	
	НетОграничений = Истина;
	
	Для Каждого Стр Из тзСоответствиеРольПеревозчик Цикл
		Если РольДоступна(Стр["НаименованиеРоли"]) Тогда
			НетОграничений = Ложь;		
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат НетОграничений;
	
КонецФункции

//+++АК sole 2018.06.07 ИП-00018920
Функция СформироватьТаблицуРезультата()
	
	Перем Запрос;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияОтчёта();
	
	ПараметрПользователя = ПолучитьПараметрПользователя("ДатаНачала");
	Запрос.Параметры.Вставить("ДатаНачала", ПараметрПользователя.Значение.Дата) ;
	
	ПараметрПользователя = ПолучитьПараметрПользователя("ДатаОкончания");
	Запрос.Параметры.Вставить("ДатаОкончания", ПараметрПользователя.Значение.Дата) ;
	
	ПараметрПользователя = ПолучитьПараметрПользователя("Перевозчик");
	Запрос.Параметры.Вставить("Перевозчик", ПараметрПользователя.Значение);
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат тзРезультат;
КонецФункции

//+++АК sole 2018.06.07 ИП-00018920
Функция ПолучитьПараметрПользователя(ИмяПараметра)
	
	Параметр = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	ПараметрПользователя = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
	
	Возврат ПараметрПользователя;
	
КонецФункции

//+++АК sole 2018.06.06 ИП-00018920
Процедура ЗаполнитьХранилищеОтчётПоВесуПоставокПоРейсам() Экспорт
	
	// Процедура объявлена экспортной, чтобы её можно было вызвать
	// в случае необходимости принудительного переформирования 
	// "тзСоответствиеРольПеревозчик" в константе
	// "ХранилищеОтчётПоВесуПоставокПоРейсам",
	// например, из произвольной внешней обработки.
	
	тзСоответствиеРольПеревозчик = СформироватьТаблицуСоответствиеРольПеревозчик();
	
	Хранилище = Новый ХранилищеЗначения(тзСоответствиеРольПеревозчик , Новый СжатиеДанных());
	Константы.ХранилищеОтчётПоВесуПоставокПоРейсам.Установить(Хранилище);
	
КонецПроцедуры

//+++АК sole 2018.06.06 ИП-00018920
Функция СформироватьТаблицуСоответствиеРольПеревозчик()
	
	тзРолейИИдентификаторовПеревозчиков = СформироватьТаблицуРолейИИдентификаторовПеревозчиков();
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст =
"ВЫБРАТЬ
|	НаименованиеРоли,
|   ПеревозчикИД
|
|		ПОМЕСТИТЬ вт
|
|ИЗ &Таблица КАК т
|;
|///////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	вт.НаименованиеРоли,
|   ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Перевозчик
|
|ИЗ вт
|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты ПО
|   		Контрагенты.ИД = вт.ПеревозчикИД
|
|";
	Запрос.Параметры.Вставить("Таблица", тзРолейИИдентификаторовПеревозчиков);
	
	тзСоответствиеРольПеревозчик = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Возврат тзСоответствиеРольПеревозчик;
КонецФункции

//+++АК sole 2018.06.06 ИП-00018920
Функция СформироватьТаблицуРолейИИдентификаторовПеревозчиков()
	
	Перем тзРезультат;
	
	тзРезультат = Новый ТаблицаЗначений();
	тзРезультат.Колонки.Добавить("НаименованиеРоли", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(128)));
	тзРезультат.Колонки.Добавить("ПеревозчикИД", Новый ОписаниеТипов("Число"));
	
	НСтр = тзРезультат.Добавить();
	НСтр["НаименованиеРоли"] = "Поставщик_АТК_40";
	НСтр["ПеревозчикИД"] = 13851;
	
	НСтр = тзРезультат.Добавить();
	НСтр["НаименованиеРоли"] = "Поставщик_Сидоров";
	НСтр["ПеревозчикИД"] = 11177;
	
	НСтр = тзРезультат.Добавить();
	НСтр["НаименованиеРоли"] = "Поставщик_ООО_Лидер";
	НСтр["ПеревозчикИД"] = 14995;

	НСтр = тзРезультат.Добавить();
	НСтр["НаименованиеРоли"] = "Поставщик_ВкусТранс";
	НСтр["ПеревозчикИД"] = 13977;
	
	НСтр = тзРезультат.Добавить();
	НСтр["НаименованиеРоли"] = "Поставщик_А_ТермоТранс";
	НСтр["ПеревозчикИД"] = 14041;
	
	Возврат тзРезультат;
	
КонецФункции


Конструктор();
